       01  CUSTOMER-RECORD.
           05 CUSTOMER-ID            PIC X(10).
           05 CUSTOMER-NAME          PIC X(30).
           05 CUSTOMER-STATUS        PIC X(01) VALUE "A".
