       01  ORDER-RECORD.
           05 ORDER-ID               PIC X(12).
           05 ORDER-QUANTITY         PIC 9(05) VALUE 0.
           05 ORDER-UNIT-PRICE       PIC 9(05)V99 VALUE 0.
           05 ORDER-GROSS-TOTAL      PIC 9(07)V99 VALUE 0.
