       01  PRICING-RULES.
           05 DISCOUNT-THRESHOLD     PIC 9(07)V99 VALUE 500.00.
           05 DISCOUNT-RATE          PIC V99 VALUE .10.
           05 TAX-RATE               PIC V99 VALUE .22.
